# 一

# 2.2.1数据快捷加载

In [77]:
import pandas as pd

In [61]:
iris_filename = 'datasets-uci-iris.csv'
iris = pd.read_csv(iris_filename,sep=',',decimal='.',header=None,
names=['sepal_length','sepal_width','petal_length','petal_width','target'])

In [62]:
iris.head(2)

   sepal_length  sepal_width  petal_length  petal_width       target
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa

In [63]:
# 获取每列名称
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'target'], dtype='object')

In [64]:
y = iris[['target']]
y

             target
0       Iris-setosa
1       Iris-setosa
2       Iris-setosa
3       Iris-setosa
4       Iris-setosa
..              ...
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

[150 rows x 1 columns]

In [65]:
x = iris[['sepal_length','sepal_width']]
x

     sepal_length  sepal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [31]:
x.shape

(150, 2)

In [32]:
y.shape

(150, 1)

# 2.2.2处理问题数据

In [23]:
import pandas as pd
fake_dataset = pd.read_csv('a_loading_example_1.csv',sep=',')
fake_dataset

,Date,Temperature_city_1,Temperature_city_2,Temperature_city_3,Which_destination
0,20140910,80.0,32.0,40,1
1,20140911,100.0,50.0,36,2
2,20140912,102.0,55.0,46,1
3,20140913,60.0,20.0,35,3
4,20140914,60.0,NaN,32,3
5,20140915,NaN,57.0,42,2

In [25]:
fake_dataset = pd.read_csv('a_loading_example_1.csv',parse_dates=[0])
fake_dataset

,Date,Temperature_city_1,Temperature_city_2,Temperature_city_3,Which_destination
0,2014-09-10,80.0,32.0,40,1
1,2014-09-11,100.0,50.0,36,2
2,2014-09-12,102.0,55.0,46,1
3,2014-09-13,60.0,20.0,35,3
4,2014-09-14,60.0,NaN,32,3
5,2014-09-15,NaN,57.0,42,2

In [26]:
fake_dataset.fillna(50)

,Date,Temperature_city_1,Temperature_city_2,Temperature_city_3,Which_destination
0,2014-09-10,80.0,32.0,40,1
1,2014-09-11,100.0,50.0,36,2
2,2014-09-12,102.0,55.0,46,1
3,2014-09-13,60.0,20.0,35,3
4,2014-09-14,60.0,50.0,32,3
5,2014-09-15,50.0,57.0,42,2

In [27]:
fake_dataset.fillna(-1)

,Date,Temperature_city_1,Temperature_city_2,Temperature_city_3,Which_destination
0,2014-09-10,80.0,32.0,40,1
1,2014-09-11,100.0,50.0,36,2
2,2014-09-12,102.0,55.0,46,1
3,2014-09-13,60.0,20.0,35,3
4,2014-09-14,60.0,-1.0,32,3
5,2014-09-15,-1.0,57.0,42,2

In [28]:
fake_dataset.fillna(fake_dataset.mean(axis=0))

,Date,Temperature_city_1,Temperature_city_2,Temperature_city_3,Which_destination
0,2014-09-10,80.0,32.0,40,1
1,2014-09-11,100.0,50.0,36,2
2,2014-09-12,102.0,55.0,46,1
3,2014-09-13,60.0,20.0,35,3
4,2014-09-14,60.0,42.8,32,3
5,2014-09-15,80.4,57.0,42,2

In [29]:
fake_dataset.fillna(fake_dataset.median(axis=0))

,Date,Temperature_city_1,Temperature_city_2,Temperature_city_3,Which_destination
0,2014-09-10,80.0,32.0,40,1
1,2014-09-11,100.0,50.0,36,2
2,2014-09-12,102.0,55.0,46,1
3,2014-09-13,60.0,20.0,35,3
4,2014-09-14,60.0,50.0,32,3
5,2014-09-15,80.0,57.0,42,2

In [30]:
bad_dataset = pd.read_csv('a_loading_example_2.csv',
error_bad_lines = False)
bad_dataset

b'Skipping line 4: expected 3 fields, saw 4\n'

   Val1  Val2  Val3
0     0     0     0
1     1     1     1
2     3     3     3

# 2.2.3处理大数据集

In [8]:
import pandas as pd
iris_chunks = pd.read_csv(iris_filename,header=None,
names=['C1','C2','C3','C4','C5'],chunksize=10)

In [9]:
for chunk in iris_chunks:
    print (chunk.shape)
    print (chunk)

(10, 5)
    C1   C2   C3   C4           C5
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa
6  4.6  3.4  1.4  0.3  Iris-setosa
7  5.0  3.4  1.5  0.2  Iris-setosa
8  4.4  2.9  1.4  0.2  Iris-setosa
9  4.9  3.1  1.5  0.1  Iris-setosa
(10, 5)
     C1   C2   C3   C4           C5
10  5.4  3.7  1.5  0.2  Iris-setosa
11  4.8  3.4  1.6  0.2  Iris-setosa
12  4.8  3.0  1.4  0.1  Iris-setosa
13  4.3  3.0  1.1  0.1  Iris-setosa
14  5.8  4.0  1.2  0.2  Iris-setosa
15  5.7  4.4  1.5  0.4  Iris-setosa
16  5.4  3.9  1.3  0.4  Iris-setosa
17  5.1  3.5  1.4  0.3  Iris-setosa
18  5.7  3.8  1.7  0.3  Iris-setosa
19  5.1  3.8  1.5  0.3  Iris-setosa
(10, 5)
     C1   C2   C3   C4           C5
20  5.4  3.4  1.7  0.2  Iris-setosa
21  5.1  3.7  1.5  0.4  Iris-setosa
22  4.6  3.6  1.0  0.2  Iris-setosa
23  5.1  3.3  1.7  0.5  Iris-setosa
24  4.8  3.4  1.9  0.2  Iris-setosa
25  5.0  3.0  1.6  0.2  Iris-setosa
26  5.0  3.4  1.6  0.4  Iris-setosa
27  5.2  3.5  1.5  0.2  Iris-setosa
28  5.2  3.4  1.4  0.2  Iris-setosa
29  4.7  3.2  1.6  0.2  Iris-setosa
(10, 5)
     C1   C2   C3   C4           C5
30  4.8  3.1  1.6  0.2  Iris-setosa
31  5.4  3.4  1.5  0.4  Iris-setosa
32  5.2  4.1  1.5  0.1  Iris-setosa
33  5.5  4.2  1.4  0.2  Iris-setosa
34  4.9  3.1  1.5  0.1  Iris-setosa
35  5.0  3.2  1.2  0.2  Iris-setosa
36  5.5  3.5  1.3  0.2  Iris-setosa
37  4.9  3.1  1.5  0.1  Iris-setosa
38  4.4  3.0  1.3  0.2  Iris-setosa
39  5.1  3.4  1.5  0.2  Iris-setosa
(10, 5)
     C1   C2   C3   C4           C5
40  5.0  3.5  1.3  0.3  Iris-setosa
41  4.5  2.3  1.3  0.3  Iris-setosa
42  4.4  3.2  1.3  0.2  Iris-setosa
43  5.0  3.5  1.6  0.6  Iris-setosa
44  5.1  3.8  1.9  0.4  Iris-setosa
45  4.8  3.0  1.4  0.3  Iris-setosa
46  5.1  3.8  1.6  0.2  Iris-setosa
47  4.6  3.2  1.4  0.2  Iris-setosa
48  5.3  3.7  1.5  0.2  Iris-setosa
49  5.0  3.3  1.4  0.2  Iris-setosa
(10, 5)
     C1   C2   C3   C4               C5
50  7.0  3.2  4.7  1.4  Iris-versicolor
51  6.4  3.2  4.5  1.5  Iris-versicolor
52  6.9  3.1  4.9  1.5  Iris-versicolor
53  5.5  2.3  4.0  1.3  Iris-versicolor
54  6.5  2.8  4.6  1.5  Iris-versicolor
55  5.7  2.8  4.5  1.3  Iris-versicolor
56  6.3  3.3  4.7  1.6  Iris-versicolor
57  4.9  2.4  3.3  1.0  Iris-versicolor
58  6.6  2.9  4.6  1.3  Iris-versicolor
59  5.2  2.7  3.9  1.4  Iris-versicolor
(10, 5)
     C1   C2   C3   C4               C5
60  5.0  2.0  3.5  1.0  Iris-versicolor
61  5.9  3.0  4.2  1.5  Iris-versicolor
62  6.0  2.2  4.0  1.0  Iris-versicolor
63  6.1  2.9  4.7  1.4  Iris-versicolor
64  5.6  2.9  3.6  1.3  Iris-versicolor
65  6.7  3.1  4.4  1.4  Iris-versicolor
66  5.6  3.0  4.5  1.5  Iris-versicolor
67  5.8  2.7  4.1  1.0  Iris-versicolor
68  6.2  2.2  4.5  1.5  Iris-versicolor
69  5.6  2.5  3.9  1.1  Iris-versicolor
(10, 5)
     C1   C2   C3   C4               C5
70  5.9  3.2  4.8  1.8  Iris-versicolor
71  6.1  2.8  4.0  1.3  Iris-versicolor
72  6.3  2.5  4.9  1.5  Iris-versicolor
73  6.1  2.8  4.7  1.2  Iris-versicolor
74  6.4  2.9  4.3  1.3  Iris-versicolor
75  6.6  3.0  4.4  1.4  Iris-versicolor
76  6.8  2.8  4.8  1.4  Iris-versicolor
77  6.7  3.0  5.0  1.7  Iris-versicolor
78  6.0  2.9  4.5  1.5  Iris-versicolor
79  5.7  2.6  3.5  1.0  Iris-versicolor
(10, 5)
     C1   C2   C3   C4               C5
80  5.5  2.4  3.8  1.1  Iris-versicolor
81  5.5  2.4  3.7  1.0  Iris-versicolor
82  5.8  2.7  3.9  1.2  Iris-versicolor
83  6.0  2.7  5.1  1.6  Iris-versicolor
84  5.4  3.0  4.5  1.5  Iris-versicolor
85  6.0  3.4  4.5  1.6  Iris-versicolor
86  6.7  3.1  4.7  1.5  Iris-versicolor
87  6.3  2.3  4.4  1.3  Iris-versicolor
88  5.6  3.0  4.1  1.3  Iris-versicolor
89  5.5  2.5  4.0  1.3  Iris-versicolor
(10, 5)
     C1   C2   C3   C4               C5
90  5.5  2.6  4.4  1.2  Iris-versicolor
91  6.1  3.0  4.6  1.4  Iris-versicolor
92  5.8  2.6  4.0  1.2  Iris-versicolor
93  5.0  2.3  3.3  1.0  Iris-versicolor
94  5.6  2.7  4.2  1.3  Iris-versicolor
95  5.7  3.0  4.2  1.2  Iris-versicolor
96  5.7  2.9  4.2  1.3  Iris-versicolor
97  6.2  2.9  4.3  1.3  Iris-versicolor
98  5.1  2.5  3.0  1.1  Iris-versicolor
99  5.7  2.8  4.1  1.3  Iris-versicolor
(10, 5)
      C1   C2   C3   C4              C5
100  6.3  3.3  6.0  2.5  Iris-virginica
101  5.8  2.7  5.1  1.9  Iris-virginica
102  7.1  3.0  5.9  2.1  Iris-virginica
103  6.3  2.9  5.6  1.8  Iris-virginica
104  6.5  3.0  5.8  2.2  Iris-virginica
105  7.6  3.0  6.6  2.1  Iris-virginica
106  4.9  2.5  4.5  1.7  Iris-virginica
107  7.3  2.9  6.3  1.8  Iris-virginica
108  6.7  2.5  5.8  1.8  Iris-virginica
109  7.2  3.6  6.1  2.5  Iris-virginica
(10, 5)
      C1   C2   C3   C4              C5
110  6.5  3.2  5.1  2.0  Iris-virginica
111  6.4  2.7  5.3  1.9  Iris-virginica
112  6.8  3.0  5.5  2.1  Iris-virginica
113  5.7  2.5  5.0  2.0  Iris-virginica
114  5.8  2.8  5.1  2.4  Iris-virginica
115  6.4  3.2  5.3  2.3  Iris-virginica
116  6.5  3.0  5.5  1.8  Iris-virginica
117  7.7  3.8  6.7  2.2  Iris-virginica
118  7.7  2.6  6.9  2.3  Iris-virginica
119  6.0  2.2  5.0  1.5  Iris-virginica
(10, 5)
      C1   C2   C3   C4              C5
120  6.9  3.2  5.7  2.3  Iris-virginica
121  5.6  2.8  4.9  2.0  Iris-virginica
122  7.7  2.8  6.7  2.0  Iris-virginica
123  6.3  2.7  4.9  1.8  Iris-virginica
124  6.7  3.3  5.7  2.1  Iris-virginica
125  7.2  3.2  6.0  1.8  Iris-virginica
126  6.2  2.8  4.8  1.8  Iris-virginica
127  6.1  3.0  4.9  1.8  Iris-virginica
128  6.4  2.8  5.6  2.1  Iris-virginica
129  7.2  3.0  5.8  1.6  Iris-virginica
(10, 5)
      C1   C2   C3   C4              C5
130  7.4  2.8  6.1  1.9  Iris-virginica
131  7.9  3.8  6.4  2.0  Iris-virginica
132  6.4  2.8  5.6  2.2  Iris-virginica
133  6.3  2.8  5.1  1.5  Iris-virginica
134  6.1  2.6  5.6  1.4  Iris-virginica
135  7.7  3.0  6.1  2.3  Iris-virginica
136  6.3  3.4  5.6  2.4  Iris-virginica
137  6.4  3.1  5.5  1.8  Iris-virginica
138  6.0  3.0  4.8  1.8  Iris-virginica
139  6.9  3.1  5.4  2.1  Iris-virginica
(10, 5)
      C1   C2   C3   C4              C5
140  6.7  3.1  5.6  2.4  Iris-virginica
141  6.9  3.1  5.1  2.3  Iris-virginica
142  5.8  2.7  5.1  1.9  Iris-virginica
143  6.8  3.2  5.9  2.3  Iris-virginica
144  6.7  3.3  5.7  2.5  Iris-virginica
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

In [10]:
iris_iterator = pd.read_csv(iris_filename,header=None,
names=['C1','C2','C3','C4','C5'],iterator = True)

In [12]:
print (iris_iterator.get_chunk(10).shape)

(10, 5)

In [13]:
print (iris_iterator.get_chunk(20))

     C1   C2   C3   C4           C5
10  5.4  3.7  1.5  0.2  Iris-setosa
11  4.8  3.4  1.6  0.2  Iris-setosa
12  4.8  3.0  1.4  0.1  Iris-setosa
13  4.3  3.0  1.1  0.1  Iris-setosa
14  5.8  4.0  1.2  0.2  Iris-setosa
15  5.7  4.4  1.5  0.4  Iris-setosa
16  5.4  3.9  1.3  0.4  Iris-setosa
17  5.1  3.5  1.4  0.3  Iris-setosa
18  5.7  3.8  1.7  0.3  Iris-setosa
19  5.1  3.8  1.5  0.3  Iris-setosa
20  5.4  3.4  1.7  0.2  Iris-setosa
21  5.1  3.7  1.5  0.4  Iris-setosa
22  4.6  3.6  1.0  0.2  Iris-setosa
23  5.1  3.3  1.7  0.5  Iris-setosa
24  4.8  3.4  1.9  0.2  Iris-setosa
25  5.0  3.0  1.6  0.2  Iris-setosa
26  5.0  3.4  1.6  0.4  Iris-setosa
27  5.2  3.5  1.5  0.2  Iris-setosa
28  5.2  3.4  1.4  0.2  Iris-setosa
29  4.7  3.2  1.6  0.2  Iris-setosa

In [14]:
piece = iris_iterator.get_chunk(2)
piece

     C1   C2   C3   C4           C5
30  4.8  3.1  1.6  0.2  Iris-setosa
31  5.4  3.4  1.5  0.4  Iris-setosa

In [24]:
# open函数在csv库中
import csv
# open也可以处理数据
# rt是以文本形式进行操作
with open(iris_filename, 'rt') as data_stream:
    # 'rt' mode
#     输出n和row
#  enumerate用于产生新的索引序列
    for n, row in enumerate(csv.DictReader(data_stream,
        fieldnames = ['sepal_length', 'sepal_width',
        'petal_length', 'petal_width', 'target'],
        dialect='excel')):
            if n== 0:
                print (n,row)
            else:
                break

0 OrderedDict([('sepal_length', '5.1'), ('sepal_width', '3.5'), ('petal_length', '1.4'), ('petal_width', '0.2'), ('target', 'Iris-setosa')])

In [25]:
with open (iris_filename,'rt') as data_stream:
    for n,row in enumerate(csv.reader(data_stream,dialect='excel')):
        if n==0:
            print (row)
        else:
            break

['5.1', '3.5', '1.4', '0.2', 'Iris-setosa']

In [26]:
# 将数据以5个p次处理的方式进行读入
def batch_read(filename, batch=5):
    # open the data stream
    with open(filename, 'rt') as data_stream:
        # reset the batch
        batch_output = list()
        # iterate over the file
        for n, row in enumerate(csv.reader(data_stream, dialect='excel')):
            # if the batch is of the right size
            if n > 0 and n % batch == 0:
                # yield back the batch as an ndarray
#                 将输出写成数组形式
                yield(np.array(batch_output))
                # reset the batch and restart
                batch_output = list()
            # otherwise add the row to the batch
            batch_output.append(row)
        # when the loop is over, yield what's left
        yield(np.array(batch_output))

In [29]:
import numpy as np
for batch_input in batch_read(iris_filename, batch=3):
    print (batch_input)
    break

[['5.1' '3.5' '1.4' '0.2' 'Iris-setosa']
 ['4.9' '3.0' '1.4' '0.2' 'Iris-setosa']
 ['4.7' '3.2' '1.3' '0.2' 'Iris-setosa']]

# 二

# 2.2.4访问其他数据格式

In [2]:
import pandas as pd
my_own_dataset = pd.DataFrame({'Coll':range(5),'Col2':
[1.0]*5,'Col3':1.0,'Col4':'Hello World!'})
my_own_dataset

   Coll  Col2  Col3          Col4
0     0   1.0   1.0  Hello World!
1     1   1.0   1.0  Hello World!
2     2   1.0   1.0  Hello World!
3     3   1.0   1.0  Hello World!
4     4   1.0   1.0  Hello World!

In [3]:
my_own_dataset.dtypes

Coll      int64
Col2    float64
Col3    float64
Col4     object
dtype: object

In [7]:
my_own_dataset['Coll'] = my_own_dataset['Coll'].astype(float)
my_own_dataset.dtypes

Coll    float64
Col2    float64
Col3    float64
Col4     object
dtype: object

# 2.2.5数据预处理

In [81]:
make_feature = iris['sepal_length'] > 6.0
make_feature

0      False
1      False
2      False
3      False
4      False
       ...
145     True
146     True
147     True
148     True
149    False
Name: sepal_length, Length: 150, dtype: bool

In [82]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'target'], dtype='object')

In [83]:
iris['target']

0      Iris-setosa
1      Iris-setosa
2      Iris-setosa
3      Iris-setosa
4      Iris-setosa
          ...
145      New label
146      New label
147      New label
148      New label
149      New label
Name: target, Length: 150, dtype: object

In [84]:
iris['target'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'New label'], dtype=object)

In [85]:
mask_target = iris['target'] =='Iris-virginica'
iris.loc[mask_target,'target'] = 'New label'

In [86]:
iris['target']

0      Iris-setosa
1      Iris-setosa
2      Iris-setosa
3      Iris-setosa
4      Iris-setosa
          ...
145      New label
146      New label
147      New label
148      New label
149      New label
Name: target, Length: 150, dtype: object

In [72]:
iris['target'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'New label'], dtype=object)

In [73]:
grouped_targets_mean = iris.groupby(['target']).mean()
grouped_targets_mean

                 sepal_length  sepal_width  petal_length  petal_width
target
Iris-setosa             5.006        3.418         1.464        0.244
Iris-versicolor         5.936        2.770         4.260        1.326
New label               6.588        2.974         5.552        2.026

In [74]:
grouped_targets_var = iris.groupby(['target']).var()
grouped_targets_var

                 sepal_length  sepal_width  petal_length  petal_width
target
Iris-setosa          0.124249     0.145180      0.030106     0.011494
Iris-versicolor      0.266433     0.098469      0.220816     0.039106
New label            0.404343     0.104004      0.304588     0.075433

In [75]:
iris.sort_values(by='sepal_length').head()

    sepal_length  sepal_width  petal_length  petal_width       target
13           4.3          3.0           1.1          0.1  Iris-setosa
42           4.4          3.2           1.3          0.2  Iris-setosa
38           4.4          3.0           1.3          0.2  Iris-setosa
8            4.4          2.9           1.4          0.2  Iris-setosa
41           4.5          2.3           1.3          0.3  Iris-setosa

In [48]:
# smooth_time_series = pd.rolling_mean(time_series,5)

In [50]:
# median_time_series = pd.rolling_median(time_series,5)

In [87]:
import numpy as np
iris.apply(np.count_nonzero, axis=1).head(10)
# axis=0是列方向，axis=1是按行方向
# 计算每一行上非零数据

0    5
1    5
2    5
3    5
4    5
5    5
6    5
7    5
8    5
9    5
dtype: int64

In [88]:
iris.apply(np.count_nonzero, axis=0)

sepal_length    150
sepal_width     150
petal_length    150
petal_width     150
target          150
dtype: int64

In [89]:
iris.applymap(lambda el:len(str(el))).head()
# lambda是一个循环函数
# 将el中的函数转换成字符串的长度

   sepal_length  sepal_width  petal_length  petal_width  target
0             3            3             3            3      11
1             3            3             3            3      11
2             3            3             3            3      11
3             3            3             3            3      11
4             3            3             3            3      11

# 2.2.6数据选择

In [51]:
import pandas as pd
dataset = pd.read_csv('a_selection_example_1.csv')
dataset

     n  val1  val2 val3
0  100    10    10    C
1  101    10    20    C
2  102    10    30    B
3  103    10    40    B
4  104    10    50    A

In [52]:
dataset = pd.read_csv('a_selection_example_1.csv',index_col=0)
dataset

     val1  val2 val3
n
100    10    10    C
101    10    20    C
102    10    30    B
103    10    40    B
104    10    50    A

In [53]:
dataset['val3'][104]

'A'

In [54]:
dataset.loc[104,'val3']

'A'

In [55]:
dataset.iloc[4,2]

'A'

In [56]:
dataset.loc[range(100,102),['val3','val2']]

    val3  val2
n
100    C    10
101    C    20

In [57]:
dataset.iloc[range(2),[2,1]]

    val3  val2
n
100    C    10
101    C    20

In [58]:
dataset[['val3','val2']][0:2]

    val3  val2
n
100    C    10
101    C    20

# 三

# 2.3使用分类数据和文本数据

# 2.3使用分类数据和文本数据

In [5]:
import pandas as pd
categorical_feature = pd.Series(['sunny','cloudy','snowy','rainy','foggy'])
mapping = pd.get_dummies(categorical_feature)
mapping

   cloudy  foggy  rainy  snowy  sunny
0       0      0      0      0      1
1       1      0      0      0      0
2       0      0      0      1      0
3       0      0      1      0      0
4       0      1      0      0      0

In [4]:
mapping['sunny']

0    1
1    0
2    0
3    0
4    0
Name: sunny, dtype: uint8

In [6]:
mapping['cloudy']

0    0
1    1
2    0
3    0
4    0
Name: cloudy, dtype: uint8

In [11]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
ohe = OneHotEncoder()
levels = ['sunny','cloudy','snowy','rainy','foggy']
fit_levs = le.fit_transform(levels)
ohe.fit([[fit_levs[0]],[fit_levs[1]],[fit_levs[2]],[fit_levs[3]],[fit_levs[4]]])
print (ohe.transform([le.transform(['sunny'])]).toarray())
print (ohe.transform([le.transform(['cloudy'])]).toarray())

[[0. 0. 0. 0. 1.]]
[[1. 0. 0. 0. 0.]]

C:\Users\84146\Anaconda3\lib\site-packages\sklearn\preprocessing\_encoders.py:415: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)

特殊的数据类型---文本

In [13]:
from sklearn.datasets import fetch_20newsgroups
categories = ['sci.med','sci.space']
twenty_sci_news = fetch_20newsgroups(categories=categories)

In [14]:
twenty_sci_news.data[0]

'From: flb@flb.optiplan.fi ("F.Baube[tm]")\nSubject: Vandalizing the sky\nX-Added: Forwarded by Space Digest\nOrganization: [via International Space University]\nOriginal-Sender: isu@VACATION.VENARI.CS.CMU.EDU\nDistribution: sci\nLines: 12\n\nFrom: "Phil G. Fraering" <pgf@srl03.cacs.usl.edu>\n> \n> Finally: this isn\'t the Bronze Age, [..]\n> please try to remember that there are more human activities than\n> those practiced by the Warrior Caste, the Farming Caste, and the\n> Priesthood.\n\nRight, the Profiting Caste is blessed by God, and may \n freely blare its presence in the evening twilight ..\n\n-- \n* Fred Baube (tm)\n'

In [15]:
twenty_sci_news.filenames

array(['C:\\Users\\84146\\scikit_learn_data\\20news_home\\20news-bydate-train\\sci.space\\61116',
       'C:\\Users\\84146\\scikit_learn_data\\20news_home\\20news-bydate-train\\sci.med\\58122',
       'C:\\Users\\84146\\scikit_learn_data\\20news_home\\20news-bydate-train\\sci.med\\58903',
       ...,
       'C:\\Users\\84146\\scikit_learn_data\\20news_home\\20news-bydate-train\\sci.space\\60774',
       'C:\\Users\\84146\\scikit_learn_data\\20news_home\\20news-bydate-train\\sci.space\\60954',
       'C:\\Users\\84146\\scikit_learn_data\\20news_home\\20news-bydate-train\\sci.med\\58911'],
      dtype='<U95')

In [21]:
print (twenty_sci_news.target[0])
print (twenty_sci_news.target_names[twenty_sci_news.target[0]])

1
sci.space

In [23]:
from sklearn.feature_extraction.text import CountVectorizer
count_vect = CountVectorizer()
word_count = count_vect.fit_transform(twenty_sci_news.data)
word_count.shape

(1187, 25638)

In [24]:
print(word_count[0])

  (0, 10827)	2
  (0, 10501)	2
  (0, 17170)	1
  (0, 10341)	1
  (0, 4762)	2
  (0, 23381)	2
  (0, 22345)	1
  (0, 24461)	1
  (0, 23137)	7
  (0, 21382)	1
  (0, 3233)	1
  (0, 10713)	1
  (0, 5650)	3
  (0, 21686)	2
  (0, 8438)	1
  (0, 17217)	1
  (0, 24626)	1
  (0, 13158)	1
  (0, 24151)	1
  (0, 17235)	1
  (0, 20909)	1
  (0, 13359)	1
  (0, 24415)	1
  (0, 24547)	1
  (0, 7646)	1
  :	:
  (0, 15968)	1
  (0, 12362)	1
  (0, 3191)	1
  (0, 23129)	1
  (0, 23241)	1
  (0, 18474)	1
  (0, 24930)	1
  (0, 6017)	3
  (0, 10188)	1
  (0, 3808)	2
  (0, 18642)	1
  (0, 20110)	1
  (0, 18744)	1
  (0, 13318)	1
  (0, 5148)	1
  (0, 11330)	1
  (0, 15246)	1
  (0, 10785)	1
  (0, 5134)	1
  (0, 13384)	1
  (0, 18586)	1
  (0, 12716)	1
  (0, 9796)	1
  (0, 23849)	1
  (0, 10778)	1

In [25]:
word_list = count_vect.get_feature_names()
for n in word_count[0].indices:
    print ("Word:",word_list[n],'appears',word_count[0,n],"times")

Word: from appears 2 times
Word: flb appears 2 times
Word: optiplan appears 1 times
Word: fi appears 1 times
Word: baube appears 2 times
Word: tm appears 2 times
Word: subject appears 1 times
Word: vandalizing appears 1 times
Word: the appears 7 times
Word: sky appears 1 times
Word: added appears 1 times
Word: forwarded appears 1 times
Word: by appears 3 times
Word: space appears 2 times
Word: digest appears 1 times
Word: organization appears 1 times
Word: via appears 1 times
Word: international appears 1 times
Word: university appears 1 times
Word: original appears 1 times
Word: sender appears 1 times
Word: isu appears 1 times
Word: vacation appears 1 times
Word: venari appears 1 times
Word: cs appears 1 times
Word: cmu appears 1 times
Word: edu appears 2 times
Word: distribution appears 1 times
Word: sci appears 1 times
Word: lines appears 1 times
Word: 12 appears 1 times
Word: phil appears 1 times
Word: fraering appears 1 times
Word: pgf appears 1 times
Word: srl03 appears 1 times
Word: cacs appears 1 times
Word: usl appears 1 times
Word: finally appears 1 times
Word: this appears 1 times
Word: isn appears 1 times
Word: bronze appears 1 times
Word: age appears 1 times
Word: please appears 1 times
Word: try appears 1 times
Word: to appears 1 times
Word: remember appears 1 times
Word: that appears 1 times
Word: there appears 1 times
Word: are appears 1 times
Word: more appears 1 times
Word: human appears 1 times
Word: activities appears 1 times
Word: than appears 1 times
Word: those appears 1 times
Word: practiced appears 1 times
Word: warrior appears 1 times
Word: caste appears 3 times
Word: farming appears 1 times
Word: and appears 2 times
Word: priesthood appears 1 times
Word: right appears 1 times
Word: profiting appears 1 times
Word: is appears 1 times
Word: blessed appears 1 times
Word: god appears 1 times
Word: may appears 1 times
Word: freely appears 1 times
Word: blare appears 1 times
Word: its appears 1 times
Word: presence appears 1 times
Word: in appears 1 times
Word: evening appears 1 times
Word: twilight appears 1 times
Word: fred appears 1 times

In [28]:
from sklearn.feature_extraction.text import TfidfVectorizer
tf_vect = TfidfVectorizer(use_idf=False,norm='l1')
word_freq = tf_vect.fit_transform(twenty_sci_news.data)
word_list = tf_vect.get_feature_names()
for n in word_freq[0].indices:
    print("Word:",word_list[n],"has frequency",word_freq[0,n])

Word: from has frequency 0.02197802197802198
Word: flb has frequency 0.02197802197802198
Word: optiplan has frequency 0.01098901098901099
Word: fi has frequency 0.01098901098901099
Word: baube has frequency 0.02197802197802198
Word: tm has frequency 0.02197802197802198
Word: subject has frequency 0.01098901098901099
Word: vandalizing has frequency 0.01098901098901099
Word: the has frequency 0.07692307692307693
Word: sky has frequency 0.01098901098901099
Word: added has frequency 0.01098901098901099
Word: forwarded has frequency 0.01098901098901099
Word: by has frequency 0.03296703296703297
Word: space has frequency 0.02197802197802198
Word: digest has frequency 0.01098901098901099
Word: organization has frequency 0.01098901098901099
Word: via has frequency 0.01098901098901099
Word: international has frequency 0.01098901098901099
Word: university has frequency 0.01098901098901099
Word: original has frequency 0.01098901098901099
Word: sender has frequency 0.01098901098901099
Word: isu has frequency 0.01098901098901099
Word: vacation has frequency 0.01098901098901099
Word: venari has frequency 0.01098901098901099
Word: cs has frequency 0.01098901098901099
Word: cmu has frequency 0.01098901098901099
Word: edu has frequency 0.02197802197802198
Word: distribution has frequency 0.01098901098901099
Word: sci has frequency 0.01098901098901099
Word: lines has frequency 0.01098901098901099
Word: 12 has frequency 0.01098901098901099
Word: phil has frequency 0.01098901098901099
Word: fraering has frequency 0.01098901098901099
Word: pgf has frequency 0.01098901098901099
Word: srl03 has frequency 0.01098901098901099
Word: cacs has frequency 0.01098901098901099
Word: usl has frequency 0.01098901098901099
Word: finally has frequency 0.01098901098901099
Word: this has frequency 0.01098901098901099
Word: isn has frequency 0.01098901098901099
Word: bronze has frequency 0.01098901098901099
Word: age has frequency 0.01098901098901099
Word: please has frequency 0.01098901098901099
Word: try has frequency 0.01098901098901099
Word: to has frequency 0.01098901098901099
Word: remember has frequency 0.01098901098901099
Word: that has frequency 0.01098901098901099
Word: there has frequency 0.01098901098901099
Word: are has frequency 0.01098901098901099
Word: more has frequency 0.01098901098901099
Word: human has frequency 0.01098901098901099
Word: activities has frequency 0.01098901098901099
Word: than has frequency 0.01098901098901099
Word: those has frequency 0.01098901098901099
Word: practiced has frequency 0.01098901098901099
Word: warrior has frequency 0.01098901098901099
Word: caste has frequency 0.03296703296703297
Word: farming has frequency 0.01098901098901099
Word: and has frequency 0.02197802197802198
Word: priesthood has frequency 0.01098901098901099
Word: right has frequency 0.01098901098901099
Word: profiting has frequency 0.01098901098901099
Word: is has frequency 0.01098901098901099
Word: blessed has frequency 0.01098901098901099
Word: god has frequency 0.01098901098901099
Word: may has frequency 0.01098901098901099
Word: freely has frequency 0.01098901098901099
Word: blare has frequency 0.01098901098901099
Word: its has frequency 0.01098901098901099
Word: presence has frequency 0.01098901098901099
Word: in has frequency 0.01098901098901099
Word: evening has frequency 0.01098901098901099
Word: twilight has frequency 0.01098901098901099
Word: fred has frequency 0.01098901098901099

In [29]:
from sklearn.feature_extraction.text import TfidfVectorizer
tfidf_vect = TfidfVectorizer( )# Default: use_idf=True
word_tfidf = tfidf_vect.fit_transform(twenty_sci_news.data)
word_list = tfidf_vect.get_feature_names()
for n in word_tfidf[0].indices:
    print("Word:",word_list[n],"has tfidf",word_tfidf[0,n])

Word: fred has tfidf 0.08936045234843078
Word: twilight has tfidf 0.13938927782180835
Word: evening has tfidf 0.11302673424119597
Word: in has tfidf 0.0239166759663498
Word: presence has tfidf 0.1188056711727349
Word: its has tfidf 0.0614868335851203
Word: blare has tfidf 0.1503934722357903
Word: freely has tfidf 0.1188056711727349
Word: may has tfidf 0.05435468556679453
Word: god has tfidf 0.1188056711727349
Word: blessed has tfidf 0.1503934722357903
Word: is has tfidf 0.025534922944795504
Word: profiting has tfidf 0.1503934722357903
Word: right has tfidf 0.06776142459179928
Word: priesthood has tfidf 0.14419623132344553
Word: and has tfidf 0.04914899480764025
Word: farming has tfidf 0.14419623132344553
Word: caste has tfidf 0.43258869397033656
Word: warrior has tfidf 0.14419623132344553
Word: practiced has tfidf 0.132141000260103
Word: those has tfidf 0.060468912973222586
Word: than has tfidf 0.05191930330186187
Word: activities has tfidf 0.09066642662557041
Word: human has tfidf 0.0844691857132256
Word: more has tfidf 0.04649724133406932
Word: are has tfidf 0.03463261182073175
Word: there has tfidf 0.03852690933840286
Word: that has tfidf 0.026770080186189097
Word: remember has tfidf 0.07688691730428243
Word: to has tfidf 0.02312167880805218
Word: try has tfidf 0.07299884066247375
Word: please has tfidf 0.07128977029653104
Word: age has tfidf 0.09158324490848231
Word: bronze has tfidf 0.14419623132344553
Word: isn has tfidf 0.07299884066247375
Word: this has tfidf 0.03108008679402127
Word: finally has tfidf 0.09747052395335588
Word: usl has tfidf 0.11179542894047015
Word: cacs has tfidf 0.11433270851833557
Word: srl03 has tfidf 0.12052994943068035
Word: pgf has tfidf 0.11433270851833557
Word: fraering has tfidf 0.11302673424119597
Word: phil has tfidf 0.10227747745499305
Word: 12 has tfidf 0.07618819730345817
Word: lines has tfidf 0.021724075391797198
Word: sci has tfidf 0.06670300928912896
Word: distribution has tfidf 0.05290729202325938
Word: edu has tfidf 0.05947852867520309
Word: cmu has tfidf 0.08134167803269202
Word: cs has tfidf 0.05460566290811566
Word: venari has tfidf 0.10306090845025996
Word: vacation has tfidf 0.09940094711578058
Word: isu has tfidf 0.09940094711578058
Word: sender has tfidf 0.09303606350425024
Word: original has tfidf 0.08515311547788547
Word: university has tfidf 0.044724150250747635
Word: international has tfidf 0.08134167803269202
Word: via has tfidf 0.083163211436086
Word: organization has tfidf 0.022204860525140275
Word: digest has tfidf 0.09459399361414342
Word: space has tfidf 0.09814129398947688
Word: by has tfidf 0.11991135778082024
Word: forwarded has tfidf 0.09627343943524701
Word: added has tfidf 0.08812914704770498
Word: sky has tfidf 0.09111995870601315
Word: the has tfidf 0.15754306290689327
Word: vandalizing has tfidf 0.10306090845025996
Word: subject has tfidf 0.021541978127203303
Word: tm has tfidf 0.2190515100333968
Word: baube has tfidf 0.264282000520206
Word: fi has tfidf 0.1095257550166984
Word: optiplan has tfidf 0.132141000260103
Word: flb has tfidf 0.264282000520206
Word: from has tfidf 0.04308395625440661

In [31]:
text_1 = 'we love data science'
text_2 = 'data science is hard'
documents = [text_1,text_2]
documents

['we love data science', 'data science is hard']

In [33]:
# That is what we say above, the default one
# 用一元语法
count_vect_1_grams = CountVectorizer(ngram_range=(1, 1),
stop_words=[], min_df=1)
word_count = count_vect_1_grams.fit_transform(documents)
word_list = count_vect_1_grams.get_feature_names()
print ("Word list = ", word_list)
# 统计第一个文本中的词
print ("text_1 is described with", [word_list[n] + "(" +
str(word_count[0, n]) + ")" for n in word_count[0].indices])

Word list =  ['data', 'hard', 'is', 'love', 'science', 'we']
text_1 is described with ['we(1)', 'love(1)', 'data(1)', 'science(1)']

In [34]:
# Now a bi-gram count vectorizer
count_vect_1_grams = CountVectorizer(ngram_range=(2, 2))
word_count = count_vect_1_grams.fit_transform(documents)
word_list = count_vect_1_grams.get_feature_names()
print ("Word list = ", word_list)
print ("text_1 is described with", [word_list[n] + "(" +
str(word_count[0, n]) + ")" for n in word_count[0].indices])

Word list =  ['data science', 'is hard', 'love data', 'science is', 'we love']
text_1 is described with ['we love(1)', 'love data(1)', 'data science(1)']

In [35]:
# Now a uni- and bi-gram count vectorizer
count_vect_1_grams = CountVectorizer(ngram_range=(1, 2))
word_count = count_vect_1_grams.fit_transform(documents)
word_list = count_vect_1_grams.get_feature_names()
print ("Word list = ", word_list)
print ("text_1 is described with", [word_list[n] + "(" +
str(word_count[0, n]) + ")" for n in word_count[0].indices])

Word list =  ['data', 'data science', 'hard', 'is', 'is hard', 'love', 'love data', 'science', 'science is', 'we', 'we love']
text_1 is described with ['we(1)', 'love(1)', 'data(1)', 'science(1)', 'we love(1)', 'love data(1)', 'data science(1)']

In [36]:
from sklearn.feature_extraction.text import HashingVectorizer
# 构造一个容量为1000的词桶
hash_vect = HashingVectorizer(n_features=1000)
word_hashed = hash_vect.fit_transform(twenty_sci_news.data)
word_hashed.shape

(1187, 1000)